cask_args appdir: '/Applications'

# source control
brew 'git'
brew 'libgit2'
cask 'github'

# utilities
brew 'the_silver_searcher'

# chats
cask 'slack'

# editors
cask 'sublime-text'
cask 'visual-studio-code-insiders'

# virtualcontainerization
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
cask 'docker-edge'

# other hashicorp goodies
brew 'terraform'
brew 'terraform-docs'
brew 'terraform_landscape'
brew 'terraform-inventory'
brew 'packer'

# browsers
cask 'google-chrome'
cask 'firefox'
cask 'postman'

# cloud config
brew 'awscli'

# graphics
brew 'graphviz'

#tap 'homebrew/services'
#
# brew 'postgresql'
# 
# brew 'mysql'
# 
# brew 'redis'
# 
# brew 'phantomjs'
# 
# brew 'hub'
# 
# tap 'cloudfoundry/homebrew-tap'
# brew 'cf-cli'

# cask 'cloud'
# cask 'flux'
